/*  float MLineSpeed[4][3] = { -0.866025,  -0.5, 0.0,  // матрица расчета линейных скоростей
                             0.866025, -0.5, 0.0,
                              0.0,  1.0,      0.0,
                              0.0,  0.0,      0.0};

  float MRotSpeed[4][3] = { 0.0, 0.0, -0.12013 , //10// матрица расчета neлинейных скоростей
                            0.0, 0.0, -0.12013,
                            0.0, 0.0, -0.08716,
                            0.0, 0.0, 0.0};


   float InverseKinematics[4][4] =               // Матрица для обратного преобразования скоростей
   {-0.5774, 0.5774, 0.0, 0.0,
   -0.2662, -0.2662, 0.7338, -0.2014,
   -3.0542,   -3.0542,   -3.0542,   9.1625,
   0.0, 0.0, 0.0, 4.0};


//   float InverseKinematics[4][4] =               // Матрица для обратного преобразования скоростей
//   {-1.2054, -0.7946, 0.3558, 1.6442,
//   0.5774, -0.5774, 0.0, 0.0,
//   0.8075,   -0.8075,   -1.3986,   1.3986,
//   0.0, 0.0, 0.0, 4.0};
*/
